---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ZoneElementDomainData Properties
ZoneElementDomainData Class See Also Send Feedback
---

The ZoneElementDomainData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ZoneElementDomainData Class

Autodesk.Revit.DB.Mechanical Namespace